fn main() {
    println!("------默认不可变------");
    let x = 3;
    println!("x = {}", x);
    let x = "隐藏 ~ 复用变量名";
    println!("x = {}", x);

    println!("------可变变量------");
    let mut x = 'A';
    println!("x = {}", x);
    x = 'B';
    println!("x = {}", x);
    let mut x = "隐藏 ~ 复用变量名";
    println!("x = {}", x);
    x = "隐藏 ~ 复用变量名";
    println!("x = {}", x);
}
/*
一.变量可变性
    1.默认不可变, mut可变
二.变量和常量区别
    1.命名规范: 下划线分隔的大写字母
    2.声明: const, 且必须标注类型
    3.不可变
    4.只能用于常量表达式, 不能作为函数返回值或在运行时计算值
        1.硬编码: 用一个固定值代替可变变量 ~ ......未看懂......
三.隐藏
    1.使用let关键字声明同名新变量隐藏同名旧变量 ~ 复用变量名
*/